request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:addPersonRequest>
         <gs:name>Spain</gs:name>
         <gs:email>Spain@spain</gs:email>
      </gs:addPersonRequest>
   </soapenv:Body>
</soapenv:Envelope>
